import { Mock, successRes } from './preSet';

export const getInfoApi = Mock.mock(RegExp('/info.*'), 'get', {
    announce_type: "regional",
    bid_type: "2658",
    date_created: "",
    date_modified: "2020-03-26 14:00:55",
    grade: "中级",
    id: "1",
    institution: "上海市长宁区人民法院",
    label: "",
    meta: '{"采购项目名称": "上海市长宁区人民法院执行事务中心排队叫号系统采购项目", "采购单位": "上海市长宁区人民法院 ", "行政区域": "上海市", "公告时间": "2020年03月23日  13:50", "项目联系人": "沈思骏、侯烨飞  ", "项目联系电话": "021-52555817 ", "采购单位地址": "上海市虹桥路1133号", "采购单位联系方式": "毕勇  021-52574999", "代理机构名称": "上海中世建设咨询有限公司", "代理机构地址": "上海市曹杨路528弄35号中世办公楼", "代理机构联系方式": "沈思骏、侯烨飞     021-52555817 "}',
    public_date: "2020-03-23 13:50:00",
    region: "上海",
    relation: "是",
    text: "上海中世建设咨询有限公司受上海市长宁区人民法院 的委托，就上海市长宁区人民法院执行事务中心排队叫号系统采购项目项目（项目编号：招案2020-0208	）组织采购，评标工作已经结束，废标/终止公告结果如下： 一、项目信息项目编号：招案2020-0208	项目名称：上海市长宁区人民法院执行事务中心排队叫号系统采购项目项目联系人：沈思骏、侯烨飞  联系方式：021-52555817  二、采购单位信息采购单位名称：上海市长宁区人民法院 采购单位地址：上海市虹桥路1133号采购单位联系方式：毕勇  021-52574999 三、采购代理机构信息采购代理机构全称：上海中世建设咨询有限公司采购代理机构地址：上海市曹杨路528弄35号中世办公楼采购代理机构联系方式：沈思骏、侯烨飞     021-52555817  四、废标、终止的原因截止至规定的响应文件递交截止时间，递交响应文件的供应商不足三家，本项目采购失败。 五、废标/终止日期：2020年03月23日 六、其它补充事宜",
    title: "上海市长宁区人民法院执行事务中心排队叫号系统采购项目失败公告",
    url: "http://www.ccgp.gov.cn/cggg/dfgg/fblbgg/202003/t20200323_14051489.htm",
})